Repository: stcarrez/spdx-tool
Catalog: po/*.po
Languages: fr

source: Add line number when printing license text
fr: Ajoute les numéros de lignes dans l'affichage des textes de license

source: cannot compile regex: '{0}'
fr: impossible de compiler l'expression régulière: '{0}'

source: cannot identify mime type for '{0}'
fr: impossible d'identifier le type mime de '{0}'

source: cannot load magic file {0}: {1}
fr: impossible de lire le fichier magic {0}: {1}

source: Check and gather licenses used in source files
fr: Identifie les licenses utilisées dans les fichiers sources

source: Confidence with {0} -> {1}
fr: Confiance avec {0} -> {1}

source: configuration file '{0}' does not exist.
fr: le fichier de configuration '{0}' n'existe pas

source: Count
fr: Nombre

source: Disable colors in output
fr: Désactiver les couleurs dans l'affichage

source: Disable internal builtin license repository
fr: Désactiver le répository des licenses internes

source: Enable debug execution
fr: Activer l'execution debug

source: error
fr: erreur

source: Error
fr: erreur

source: Exclude pattern {0}
fr: Exclusion avec le modèle {0}

source: excluded file {0}
fr: fichier exclu {0}

source: extract license from lines{0} to{1}
fr: extraction de la license des lignes{0} à{1}

source: Generate a JSON report with licenses and files
fr: Génère un rapport JSON avec les licenses et fichiers

source: Generate a XML report with licenses and files
fr: Génère un rapport XML avec les licenses et fichiers

source: Identify mime types of files
fr: Identifie le type mime des fichiers

source: Identify the license and only print the SPDX license
fr: Identifie la license et n'affiche que son nom SPDX

source: ignore file {} not found
fr: fichier d'exclusion {} non trouvé

source: Ignore the files with languages in the given list
fr: Ignorer les fichiers avec un des langages de la liste

source: Ignore the files with licenses in the given list
fr: Ignorer les fichiers avec une des licenses de la liste

source: Include pattern {0}
fr: Inclusion avec le modèle {0}

source: invalid builtin ignore file {0}
fr: fichier d'exclusion est invalide {0}

source: invalid configuration file:
fr: mauvais fichier de configuration:

source: invalid configuration {0}
fr: mauvaise configuration {0}

source: invalid default configuration file
fr: mauvaise configuration par défaut

source: invalid language {0}
fr: langage invalide {0}

source: invalid number of tasks: {0}
fr: nombre de taches incorrect: {0}

source: invalid option --update: {}
fr: option --update invalide: {}

source: Invalid range of line:
fr: Mauvaise définition de lignes:

source: invalid update pattern
fr: pattern de mise à jour incorrect

source: job {0} failed
fr: échec de l'execution {0}

source: Keep generated files
fr: Conserver les fichiers générés

source: Language
fr: Langage

source: language {0} identified by {1} with confidence{2}
fr: langage {0} identifié par {1} avec une confidence de{2}

source: language {0}: invalid comment style {1}
fr: language {0}: style de commentaire invalid {1}

source: license '{0}' missmatch at line{1} after {2} lines ({3} matched)
fr: license '{0}' rejetée à la ligne{1} après {2} lignes ({3} correct)

source: license missmatch at line{0} after {1} lines ({2} matched)
fr: license rejetée à la ligne{0} après {1} lignes ({2} correct)

source: List files grouped by license name
fr: Liste les fichiers groupés par nom de license

source: load license template {0}
fr: chargement du template de license {0}

source: loading default configuration
fr: chargement de la configuration par défaut

source: loading licenses from {0}
fr: chargement des licenses depuis {0}

source: Match
fr: Type

source: Mime type
fr: Type mime

source: missing 'spdx' tag in the pattern
fr: manque le tag 'spdx' dans le pattern

source: More verbose execution mode
fr: Mode d'exécution encore plus détaillé

source: No exact match on {0} licenses
fr: Pas de correspondance pour {0} licenses

source: None
fr: Aucun

source: not with a <<beginOptional>> element
fr: pas dans un élément <<beginOptional>>

source: Number of threads to process the files
fr: Nombre de tâches pour traiter les fichiers

source: Only consider files with languages in the given list
fr: Ne prendre en compte que les langages de la liste

source: Only consider files with licenses in the given list
fr: Ne prendre en compte que les licenses de la liste

source: path '{0}' does not exist
fr: le chemin '{0}' n'existe pas

source: Path of a license template or a directory with templates
fr: Chemin du fichier de license ou répertoire des licenses

source: Path of the spdx-tool configuration file
fr: Chemin du fichier de configuration de spdx-tool

source: Print languages used in files
fr: Affiche les langages utilisés dans les fichiers

source: Print license found in header files
fr: Affiche la license trouvée dans le fichier

source: Print program usage
fr: Affiche l'usage du programme

source: Print the version
fr: Affiche le numéro de version

source: Ratio
fr: Rapport

source: reading configuration file '{0}'
fr: lecture du fichier de configuration '{0}

source: scan file {0}
fr: analyse du fichier {0}

source: Scan git submodules
fr: Parcourir les sous-modules git

source: some internal error occurred
fr: erreur interne

source: spdx-tool - SPDX license management tool
fr: spdx-tool - Outil de gestion de license SPDX

source: too many nested <<beginOptional>>
fr: trop d'éléments <<beginOptional>> imbriqués

source: too many recursive depend {0}
fr: trop de dépendances récursives {0}

source: try 'spdx-tool --help' for more information.
fr: essayez 'spdx-tool --help' pour plus d'information

source: Unknown
fr: Inconnu

source: unrecognized option '{}'
fr: option non reconnue '{}'

source: Update the license to use the SPDX license tag
fr: Mettre à jour la license pour utiliser le tag SPDX

source: Verbose execution mode
fr: Mode d'exécution détaillé

source: writing license {0} in {1}
fr: écriture de la license {0} dans {1}

source: {0} is {1}: {2} lines no comment
fr: {0} est {1}: {2} lignes sans commentaire

source: {0} is {1}: {2} lines {3} cmt
fr: {0} is {1}: {2} lignes {3} commentaires

source: {0}: generated file by {1} (ignored)
fr: {0}: fichier généré par {1} (ignoré)

source: {0}: language {1} with analyzer
fr: {0}: langage {1} avec analyseur

source: {0}: language {1} with default analyzer
fr: {0}: langage {1} avec analyseur par défaut

source: {0}: language {1} without analyzer
fr: {0}: langage {1} sans analyseur

source: {0}: no language found
fr: {0}: pas de language identifié

source: {0}: no license found
fr: {0}: pas de license identifié

source: {0}: {1} (ignored)
fr: {0}: {1} (ignoré)

source: {0}: {1} (ignored at lines {2})
fr: {0}: {1} (ignoré à la ligne {2})

source: {0}: {1} at lines {2}
fr: {0}: {1} à la ligne {2}
